{
  "title": "SUPER SLUT",
  "sections": {
    "opening": {
      "title": "SUPER SLUT",
      "description": [
        "Hi hi! Welcome to the Halls of the Lightbringer! Before you ask, I am not the Lightbringer and no you may not speak to the Lightbringer. My name is Illendria and- WHAT?! Have you never heard of the Lightbringer? Well, I know you're mortal and all, but WOW... I'm surprised, I guess I have some explaining to do then. You see the Lightbringer is this totally amazing and dreamy goddess who turns puny mortals into great heroes and sends them off into the universe to bring order, niceness and all that good stuff. The Lightbringer was wounded in an epic battle that prevented the destruction of the multiverse, I participated too you know, so you're welcome, no need to thank me. Aaaanyways- since the Lighbringer is still wounded she won't be able to personally train you. So I Illendria, the goddess of love and desire will act as the Lightbringers stand-in. But I have better things to do than teach you like morality lessons that build character, cultivate inner strength, prevent you from being corrupted by evil and bla bla bla. so l'm just going to zap you with superpowers instead. What do you mean I sound super frivolous and I'm not taking this seriously? Do you need those lessons? Like are you a bad person or something? Because I could totally find another mortal and zap them with superpowers instead. Just kidding!~ That was actually a test to see if you were a good person and you passed with flying colors! Not to brag, but I have watched like a lot of superhero movies from your world to prepare me for this hero business, so I am totally knowing what I am doing. Like Obi-Wan Kenobi once said, with power comes great responsibility. My knowledge of your world is pretty impressive, right? What do you mean Uncle Ben said that? Uncle Ben Kenobi am I right? Now stand still and l'll start the zappening!"
      ]
    },
    "gender": {
      "title": "Gender",
      "description": [
        "Wait! I feel like I am forgetting something very important. Hmm, the most important thing about heroes is not their superpowers... no, it's their looks! Yes! I have never seen an ugly superhero! Who would want to get saved by a total uggo anyways? Not me, that's for sure. So let's get you a total makeover first. So what gender do you want to be? Like you don't have to be the gender you were born with, actually, I prefer you didn't, it really doesn't suit you you know. On second thought, this makeover is like reeeeally delicate and it will like influence your superpowers. Yes, you get like Power Points for choosing how your new body will look like. Some options will grant you more Power Points than others and then you will spend your Power Points to purchase superpowers. Yes, that is totally how this works and it's not something I just made up! I also don't want your new body to get all wrinkly and old so l'll grant you eternal youth. Like it would be such a waste for me to make you look beautiful and then after a couple of years you would just get ugly again. I almost forgot something else, it is super important for a superhero to have weaknesses and flaws. So most options will have 1 connected drawback. While the drawbacks are totally optional, they will grant you Power Points if you take them. You can take drawbacks that are not connected to the options you choose. But if you do take a drawback that is connected to an option you have chosen you will gain 3 additional Power Points. Some options and drawbacks also have requirements which you must obey in order to pick them."
      ],
      "cols": 2,
      "choices": [
        {
          "title": "Female",
          "description": [
            "I don't do makeovers half-heartedly so I will not turn you into a girl, I will turn you into THE GIRL, your beauty will be divine. As a girl, you will inspire lust and desire in all who gaze upon you. Everyone will want you, yeah that means the supervillains, especially the supervillains. They will want to rape and ravage you. No, sorry, I won't settle for anything less than divine beauty! If this option caused you to change gender you gain 10 additional Power Points."
          ],
          "points": {
            "power": 20
          },
          "connectedDrawback": "Girly"
        },
        {
          "title": "Male",
          "description": [
            "Yeah, and there is also the option to be a man... It's not like I don't like men but let's just say I enjoy their penises a lot more than I enjoy their looks. I'm also not very good at flesh sculpting males, I won't be able to make you as beautiful as if you chose to be a girl, but l'll do my best. Which will probably make you the best looking man on the planet, but your looks won't be like divine or anything. If this option caused you to change gender you gain 10 additional Power Points."
          ],
          "points": {
            "power": 20
          },
          "connectedDrawback": "Chivalrous"
        }
      ]
    },
    "appearance": {
      "title": "Appearance",
      "description": [
        "What about some special features, like it would be totally boring if you looked like every other human. Like how lame would that be?"
      ],
      "cols": 3,
      "choices": [
        {
          "title": "Human",
          "description": [
            "Seriously? Do you want to be a boring human? What's the point in being a superhero if you're just going to look like everyone else. Stop being lame!"
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Unnatural Skin Color"
        },
        {
          "title": "Metahuman",
          "description": [
            "You must choose to gain at least 1 minor biologically impossible body feature. For example, your hair is made out of slime, your eyes glow red or your hair is made out of harmless fire."
          ],
          "points": {
            "power": 4
          },
          "connectedDrawback": "Otherworldly"
        },
        {
          "title": "Humanoid",
          "description": [
            "What about some non-human features? You can choose any non-human features you want, but must choose at least 1 feature. Like squirrel ears and a tail, vampire fangs, elf ears, antennas or tentacle hair."
          ],
          "points": {
            "power": 3
          },
          "connectedDrawback": "Animal Genitals"
        }
      ]
    },
    "hair_color": {
      "title": "Hair Color",
      "description": [
        "This is gonna be 1 of the most important questions l'll ask you. Ok, take a deep breath and prepare yourself. What color do you want your hair to be? Like your hair color is super important for first impressions and the kind of vibes you want to send out."
      ],
      "cols": 3,
      "choices": [
        {
          "title": "Blonde",
          "description": [
            "Blondes are often thought of as party girls. Seen as happy, cheerful, fun and social. However, they are also seen as vain, dumb and promiscuous compared to other hair colors. Totally undeserved if you ask me!"
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Airhead"
        },
        {
          "title": "Brown",
          "description": [
            "Brunettes have a reputation for being sophisticated, intelligent and mature. But they are also viewd as boring and plain compared to their blonde, red, white and raven-haired counterparts."
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Four Eyes"
        },
        {
          "title": "Black",
          "description": [
            "Mysterious, exotic and reserved are just some traits that are associated with black hair. On the other hand, black haired people are thought to be more untrustworthy, cold and ruthless than people of other hair colors."
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Sadist"
        },
        {
          "title": "Red",
          "description": [
            "People tend to see redheads as unique, interesting, passionate, loving and sensual! On the other hand, they get a bad rap for being aggressive and promiscuous."
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Slut"
        },
        {
          "title": "White",
          "description": [
            "White hair is associated with purity, virtue, wisdom and maturity. However white haired people are also viewed as cold, distant and introvert."
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Emotionless"
        },
        {
          "title": "Unnatural",
          "description": [
            "Why settle for a mortal hair color? You can have any hair color you want! Pink hair, blue hair, green hair or why not rainbow colored hair? The sky is the limit!"
          ],
          "points": {
            "power": 3
          },
          "connectedDrawback": "Daddy Issues"
        }
      ]
    }
  },
  "drawbacks": [
    {
      "title": "Girly",
      "description": [
        "Your subconscious mind will be altered to make your body language and the way you speak super feminine. You'll act like a stereotypical girl and you will also start to like girly things, like makeup and pretty dresses."
      ],
      "points": {
        "power": 8
      },
      "connectedChoice": "Female"
    },
    {
      "title": "Chivalrous",
      "description": [
        "Your subconscious mind will be altered to make you act like a perfect gentleman. You will be gallant, courteous and polite. Acting dishonorably, especially towards women becomes unthinkable to you."
      ],
      "points": {
        "power": 10
      },
      "connectedChoice": "Male"
    },
    {
      "title": "Unnatural Skin Color",
      "description": [
        "How about we just change your skin color? That would be totally aaaawseome!- Just pick any unnatural skin color you want and l'll work my magic on you."
      ],
      "points": {
        "power": 8
      },
      "connectedChoice": "Human"
    },
    {
      "title": "Otherworldly",
      "description": [
        "You must choose to gain at least 1 major biologically impossible body feature which will affect most of your body. It can be the same as the minor feature you choose from Metahuman, but on a larger scale."
      ],
      "points": {
        "power": 15
      },
      "connectedChoice": "Metahuman"
    },
    {
      "title": "Animal Genitals",
      "description": [
        "Instead of having a human cock, you will have the penis of an animal. You may choose the animal, but I highly recommend that you go with a horse cock or a horse pussy!"
      ],
      "points": {
        "power": 10
      },
      "connectedChoice": "Humanoid"
    },
    {
      "title": "Airhead",
      "description": [
        "You're going to be a bit dumber. You'll often find yourself lose your train of thought and forget things a lot, but that's totally fine, being a bit ditzy is totally adorbs! Being smart is so overrated."
      ],
      "points": {
        "power": 12
      },
      "connectedChoice": "Blonde"
    },
    {
      "title": "Four Eyes",
      "description": [
        "You will get really bad eyesight. Like you will need to wear glasses to see anything. Your eyesight can never get better by magic, technology, etc. While wearing your superhero uniform you can uses lenses, but otherwise, lenses won't work."
      ],
      "points": {
        "power": 7
      },
      "connectedChoice": "Brown"
    },
    {
      "title": "Sadist",
      "description": [
        "You will become a huge sadist, nothing will turn you on more than seeing others suffer, especially supervillains and their goons. Making them scream and beg for mercy will feel like the best thing ever."
      ],
      "points": {
        "power": 10
      },
      "connectedChoice": "Black"
    },
    {
      "title": "Slut",
      "description": [
        "Your libido will be boosted to slut levels. You'll crave sex on a daily basis and sex it will never be far from your thoughts. If you go to0 long without sex you'll start to act like a bitch in heat."
      ],
      "points": {
        "power": 10
      },
      "connectedChoice": "Red"
    },
    {
      "title": "Emotionless",
      "description": [
        "You will become unable to express emotions with your face and your voice. You'll have the best poker face in the world and you will always speak in a flat monotone voice."
      ],
      "points": {
        "power": 10
      },
      "connectedChoice": "White"
    },
    {
      "title": "Daddy Issues",
      "description": [
        "You absolutely hate and despise men, yes all men. You will instinctively act like a passive-aggressive little bitch whenever you interact with a man, be it the president or a starving homeless man."
      ],
      "points": {
        "power": 10
      },
      "connectedChoice": "Unnatural"
    }
  ],
  "skeletons": {
    "basic": {
      "title": "",
      "description": [
        ""
      ],
      "points": {
        "power": 0
      },
      "connectedDrawback": ""
    },
    "drawback": {
      "title": "",
      "description": [
        ""
      ],
      "points": {
        "power": 0
      },
      "connectedChoice": ""
    }
  }
}
