{
  "title": "SUPER SLUT",
  "sections": {
    "opening": {
      "title": "SUPER SLUT",
      "description": [
        "Hi hi! Welcome to the Halls of the Lightbringer! Before you ask, I am not the Lightbringer and no you may not speak to the Lightbringer. My name is Illendria and- WHAT?! Have you never heard of the Lightbringer? Well, I know you're mortal and all, but WOW... I'm surprised, I guess I have some explaining to do then. You see the Lightbringer is this totally amazing and dreamy goddess who turns puny mortals into great heroes and sends them off into the universe to bring order, niceness and all that good stuff. The Lightbringer was wounded in an epic battle that prevented the destruction of the multiverse, I participated too you know, so you're welcome, no need to thank me. Aaaanyways- since the Lighbringer is still wounded she won't be able to personally train you. So I Illendria, the goddess of love and desire will act as the Lightbringers stand-in. But I have better things to do than teach you like morality lessons that build character, cultivate inner strength, prevent you from being corrupted by evil and bla bla bla. so l'm just going to zap you with superpowers instead. What do you mean I sound super frivolous and I'm not taking this seriously? Do you need those lessons? Like are you a bad person or something? Because I could totally find another mortal and zap them with superpowers instead. Just kidding!~ That was actually a test to see if you were a good person and you passed with flying colors! Not to brag, but I have watched like a lot of superhero movies from your world to prepare me for this hero business, so I am totally knowing what I am doing. Like Obi-Wan Kenobi once said, with power comes great responsibility. My knowledge of your world is pretty impressive, right? What do you mean Uncle Ben said that? Uncle Ben Kenobi am I right? Now stand still and l'll start the zappening!"
      ]
    },
    "gender": {
      "title": "Gender",
      "description": [
        "Wait! I feel like I am forgetting something very important. Hmm, the most important thing about heroes is not their superpowers... no, it's their looks! Yes! I have never seen an ugly superhero! Who would want to get saved by a total uggo anyways? Not me, that's for sure. So let's get you a total makeover first. So what gender do you want to be? Like you don't have to be the gender you were born with, actually, I prefer you didn't, it really doesn't suit you you know. On second thought, this makeover is like reeeeally delicate and it will like influence your superpowers. Yes, you get like Power Points for choosing how your new body will look like. Some options will grant you more Power Points than others and then you will spend your Power Points to purchase superpowers. Yes, that is totally how this works and it's not something I just made up! I also don't want your new body to get all wrinkly and old so l'll grant you eternal youth. Like it would be such a waste for me to make you look beautiful and then after a couple of years you would just get ugly again. I almost forgot something else, it is super important for a superhero to have weaknesses and flaws. So most options will have 1 connected drawback. While the drawbacks are totally optional, they will grant you Power Points if you take them. You can take drawbacks that are not connected to the options you choose. But if you do take a drawback that is connected to an option you have chosen you will gain 3 additional Power Points. Some options and drawbacks also have requirements which you must obey in order to pick them."
      ],
      "cols": 2,
      "choices": [
        {
          "title": "Female",
          "id": 1,
          "description": [
            "I don't do makeovers half-heartedly so I will not turn you into a girl, I will turn you into THE GIRL, your beauty will be divine. As a girl, you will inspire lust and desire in all who gaze upon you. Everyone will want you, yeah that means the supervillains, especially the supervillains. They will want to rape and ravage you. No, sorry, I won't settle for anything less than divine beauty! If this option caused you to change gender you gain 10 additional Power Points."
          ],
          "points": {
            "power": 20
          },
          "connectedDrawback": "Girly"
        },
        {
          "title": "Male",
          "id": 2,
          "description": [
            "Yeah, and there is also the option to be a man... It's not like I don't like men but let's just say I enjoy their penises a lot more than I enjoy their looks. I'm also not very good at flesh sculpting males, I won't be able to make you as beautiful as if you chose to be a girl, but l'll do my best. Which will probably make you the best looking man on the planet, but your looks won't be like divine or anything. If this option caused you to change gender you gain 10 additional Power Points."
          ],
          "points": {
            "power": 20
          },
          "connectedDrawback": "Chivalrous"
        }
      ]
    },
    "appearance": {
      "title": "Appearance",
      "description": [
        "What about some special features, like it would be totally boring if you looked like every other human. Like how lame would that be?"
      ],
      "cols": 3,
      "choices": [
        {
          "title": "Human",
          "id": 3,
          "description": [
            "Seriously? Do you want to be a boring human? What's the point in being a superhero if you're just going to look like everyone else. Stop being lame!"
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Unnatural Skin Color"
        },
        {
          "title": "Metahuman",
          "id": 4,
          "description": [
            "You must choose to gain at least 1 minor biologically impossible body feature. For example, your hair is made out of slime, your eyes glow red or your hair is made out of harmless fire."
          ],
          "points": {
            "power": 4
          },
          "connectedDrawback": "Otherworldly"
        },
        {
          "title": "Humanoid",
          "id": 5,
          "description": [
            "What about some non-human features? You can choose any non-human features you want, but must choose at least 1 feature. Like squirrel ears and a tail, vampire fangs, elf ears, antennas or tentacle hair."
          ],
          "points": {
            "power": 3
          },
          "connectedDrawback": "Animal Genitals"
        }
      ]
    },
    "hair_color": {
      "title": "Hair Color",
      "description": [
        "This is gonna be 1 of the most important questions l'll ask you. Ok, take a deep breath and prepare yourself. What color do you want your hair to be? Like your hair color is super important for first impressions and the kind of vibes you want to send out."
      ],
      "cols": 3,
      "choices": [
        {
          "title": "Blonde",
          "id": 6,
          "description": [
            "Blondes are often thought of as party girls. Seen as happy, cheerful, fun and social. However, they are also seen as vain, dumb and promiscuous compared to other hair colors. Totally undeserved if you ask me!"
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Airhead"
        },
        {
          "title": "Brown",
          "id": 7,
          "description": [
            "Brunettes have a reputation for being sophisticated, intelligent and mature. But they are also viewd as boring and plain compared to their blonde, red, white and raven-haired counterparts."
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Four Eyes"
        },
        {
          "title": "Black",
          "id": 8,
          "description": [
            "Mysterious, exotic and reserved are just some traits that are associated with black hair. On the other hand, black haired people are thought to be more untrustworthy, cold and ruthless than people of other hair colors."
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Sadist"
        },
        {
          "title": "Red",
          "id": 9,
          "description": [
            "People tend to see redheads as unique, interesting, passionate, loving and sensual! On the other hand, they get a bad rap for being aggressive and promiscuous."
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Slut"
        },
        {
          "title": "White",
          "id": 10,
          "description": [
            "White hair is associated with purity, virtue, wisdom and maturity. However white haired people are also viewed as cold, distant and introvert."
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Emotionless"
        },
        {
          "title": "Unnatural",
          "id": 11,
          "description": [
            "Why settle for a mortal hair color? You can have any hair color you want! Pink hair, blue hair, green hair or why not rainbow colored hair? The sky is the limit!"
          ],
          "points": {
            "power": 3
          },
          "connectedDrawback": "Daddy Issues"
        }
      ]
    },
    "body_figure": {
      "title": "Body Figure",
      "description": [
        "This hero business is much more fun than I realized! Anywaaaays- what kind of shape do you want your body to have? I'll make sure you will keep it forever, so you can eat whatever you want and never get fat and stuff."
      ],
      "cols": 3,
      "choices": [
        {
          "title": "Youthful",
          "id": 12,
          "description": [
            "I can make you look super young and cute! You will be so adorable, just imagining it makes me want to pinch your little checks and hug you. On the downside, this body type will make bad guys want to do a lot more unsavory things to you than pinch your checks."
          ],
          "points": {
            "power": 3
          },
          "connectedDrawback": "Hairless"
        },
        {
          "title": "Petite",
          "id": 13,
          "description": [
            "How about I make you thin, lithe, delicate and dainty? You'll be the pinnacle of elegance and femininity, a statue of beauty! Your thin frame will make you look vulnerable, yet strong and courageous!"
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Freckles"
        },
        {
          "title": "Curvacious",
          "id": 14,
          "description": [
            "What about sexy? I could make your body voluptuous, lush, seductive and sultry. You will have curves at all the right places, thin waist, big hips, you know the deal, you'll be a total sex bomb. No one would be able to resist your ample body."
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Plump Lips"
        },
        {
          "title": "Average",
          "id": 15,
          "description": [
            "I call this body type the average body type since most people have this kind of body shape. But trust me, honey, I will make you look anything but average."
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Basic Bitch"
        },
        {
          "title": "Fit",
          "id": 16,
          "description": [
            "Would you like to have a slim, athletic, well-toned body? You will look strong and yet agile."
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Workout Whore"
        },
        {
          "title": "Muscular",
          "id": 17,
          "description": [
            "How about some big bulging muscles? How about a lot of big bulging muscles? I could give your body a herculean build that radiates strength and power."
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Hairy"
        },
        {
          "title": "Androgenous",
          "id": 18,
          "description": [
            "Wanna look feminine and masculine at the same time? People will have a hard time discerning your true gender."
          ],
          "points": {
            "power": 3
          },
          "connectedDrawback": "Crossdresser"
        },
        {
          "title": "Chubby",
          "id": 19,
          "description": [
            "How about some jelly on the belly? You won't look obese, you'll just look jiggly and fluffy in all the right places."
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Fat Distribution"
        },
        {
          "title": "Fat",
          "id": 20,
          "description": [
            "Do you wanna look totally flubbers? I can turn you into a fat mc fatty, you'll be the hottest landwhale ever!"
          ],
          "points": {
            "power": 10
          },
          "connectedDrawback": "Hungry Hippo"
        }
      ]
    },
    "body_size": {
      "title": "Body Size",
      "description": [
        "Soooooo- how big do you want to be? *Giggle* I meant your body size, but don't worry we will get to that later."
      ],
      "cols": 3,
      "choices": [
        {
          "title": "Tiny",
          "id": 21,
          "description": [
            "It would be really adorable if you were super tiny like a fairy. It might be a bit hard to fight crime being the size of a doll, but it definitely would look cute as fuck!"
          ],
          "points": {
            "power": 10
          },
          "connectedDrawback": "Submissive"
        },
        {
          "title": "Small",
          "id": 22,
          "description": [
            "Perhaps you want to be a bit taller? How about the size of a small child? It would make you really approachable, but some might not take you seriously because of your height... or lack of it."
          ],
          "points": {
            "power": 3
          },
          "connectedDrawback": "Submissive"
        },
        {
          "title": "Short",
          "id": 23,
          "description": [
            "How about being shorter than the average person of your gender? Bigger is not always better. Smaller is cuter you know!"
          ],
          "points": {
            "power": 3
          },
          "connectedDrawback": "Submissive"
        },
        {
          "title": "Average",
          "id": 24,
          "description": [
            "Really? You want to be average-sized for your gender? That's soooo boring! But I guess it would be easier to keep your identity hidden if you didn't have some crazy height that made you stand out."
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Switch"
        },
        {
          "title": "Tall",
          "id": 25,
          "description": [
            "Would you like to be really tall? You could be tall like an amazonian warrior, you would stand head and shoulders above the tallest of men. Being this tall would make you a bit intimidating to approach."
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Dominant"
        },
        {
          "title": "Colossal",
          "id": 26,
          "description": [
            "I have this crazy idea, how about I make you big as a giant? That's like twice the size of a human. You would tower over your fellow men. I think it's really fitting for a superhero since they should be larger than life."
          ],
          "points": {
            "power": 8
          },
          "connectedDrawback": "Dominant"
        }
      ]
    },
    "breast_size": {
      "title": "Breast Size",
      "description": [
        "What about tits? Specifically, your tits, do you like em big or small? Since I am a generous and merciful goddess, your tits won't cause you any back pains or problems with your back, no matter how big they are."
      ],
      "cols": 3,
      "choices": [
        {
          "title": "Flat",
          "id": 27,
          "description": [
            "Do you want to be flat as a little girl? Being flat-chested looks best when you're either male or have a young or petite body."
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Breast Envy"
        },
        {
          "title": "Small Tits",
          "id": 28,
          "description": [
            "I can give you small and cutesy tits! How about that? You'll have the cutest tits around!"
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Breast Envy"
        },
        {
          "title": "Medium Tits",
          "id": 29,
          "description": [
            "Please don't tell me you want to have boring medium-sized tits like most girls have. Do you want your action figures to sell or not?"
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Erogenous Nipples"
        },
        {
          "title": "Large Tits",
          "id": 30,
          "description": [
            "You will have really big tits, but you could always go bigger you know. You shouldn't half-ass tits, like either go super big or go flat."
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Fuckable Nipples"
        },
        {
          "title": "Big Tits",
          "id": 31,
          "description": [
            "Now we are talking, tits this big is really jiggly, bouncy and squishy, perfect for a superheroine!"
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Lactation"
        },
        {
          "title": "Super Tits",
          "id": 32,
          "description": [
            "You'll have the breastest breasts! Your bountiful chest is guaranteed to give you lots of news coverage and adoring fans!"
          ],
          "points": {
            "power": 6
          },
          "connectedDrawback": "Inverted Nipples"
        }
      ]
    },
    "butt_size": {
      "title": "Butt Size",
      "description": [
        "How about some junk in the trunk or perhaps you prefer a teeny-tiny teen ass?"
      ],
      "cols": 3,
      "choices": [
        {
          "title": "Tiny Ass",
          "id": 33,
          "description": [
            "You'll have a tiny ass, a perfect choice if you're going for that classic jail bait look!"
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Anal Hater"
        },
        {
          "title": "Small Ass",
          "id": 34,
          "description": [
            "Your behind will be a bit bigger and a bit less boney, but it won't be as cute as a tiny ass!"
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Anal Hater"
        },
        {
          "title": "Medium Ass",
          "id": 35,
          "description": [
            "A medium-sized ass is a lot more well defined than the previous option, but also a bit more boring if you ask me."
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Sensitive Butt"
        },
        {
          "title": "Large Ass",
          "id": 36,
          "description": [
            "You're gonna have a big slappable bubble butt, it will look as if it was sculpted by a Goddess. I guess it technically is..."
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Puffy Anus"
        },
        {
          "title": "Big Ass",
          "id": 37,
          "description": [
            "Heads are going to turn and lips are going to get bitten when you walk by with your glorious ass."
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Buttslut"
        },
        {
          "title": "Super Ass",
          "id": 38,
          "description": [
            "Your ass will literally be a super ass. It will be thicker than the most ponderous of tomes."
          ],
          "points": {
            "power": 8
          },
          "connectedDrawback": "Puffy Pussy"
        }
      ]
    },
    "genitals": {
      "title": "Genitals",
      "description": [
        "Now what kind of genitals do you want? I know you choose a gender at the beginning of this makeover, but don't you want to spice it up a little? Like you could be a girl with a huge cock or a man with a pussy."
      ],
      "closer": [
        "Almost done! I'll just fill out the blank spaces by peering through your mind and referencing your ideal appearance aaaand... Done!- Wow, just look at you! You're a total sex bomb, who could have imagined you could look so good? Let me summon a mirror for you, are you happy with the end result? Yeah, you should be, I put in a lot of work to make you look this good. I also took the liberty to remove your refractory period after sex."
      ],
      "cols": 3,
      "choices": [
        {
          "title": "Vagina",
          "id": 39,
          "description": [
            "You will have a vagina, I can make it an innie, outy or roasty pussy, whatever you want!"
          ],
          "points": {
            "power": 2
          },
          "connectedDrawback": "Penis Vagina"
        },
        {
          "title": "Small Penis",
          "id": 40,
          "description": [
            "Ever wanted to have an adorably small and effeminate penis? It can be anything from a micropenis to a small-sized penis."
          ],
          "points": {
            "power": 10
          },
          "connectedDrawback": "Premature Ejaculation"
        },
        {
          "title": "Medium Penis",
          "id": 41,
          "description": [
            "Would you rather have a medium-sized penis? Come on don't be boring, why would you want an average-sized penis?"
          ],
          "points": {
            "power": 0
          },
          "connectedDrawback": "Limp Dick"
        },
        {
          "title": "Large Penis",
          "id": 42,
          "description": [
            "How about a large penis? Like above average-sized, it will be really big, but it won't be freak show big. Most women will be really impressed with your penis, but they won't be in penis awe. Come on, you can do better!"
          ],
          "points": {
            "power": 1
          },
          "connectedDrawback": "Always Hard"
        },
        {
          "title": "Big Penis",
          "id": 43,
          "description": [
            "Or perhaps you want a bigger penis? Like really big! It will make a huge buige in your pants and it will be next to impossible to hide, even while it's flaccid. But that's part of the charm, right?"
          ],
          "points": {
            "power": 3
          },
          "connectedDrawback": "Fuckable Peehole"
        },
        {
          "title": "Super Penis",
          "id": 44,
          "description": [
            "What about a super big penis? Because of its absurd size, it will inconvenience you in your everyday life and it might get in the way during your crimefighting and all but, it would totally be worth it, just trust me!"
          ],
          "points": {
            "power": 8
          },
          "connectedDrawback": "Liquid Fountain"
        }
      ]
    }
  },
  "drawbacks": [
    {
      "title": "Girly",
      "description": [
        "Your subconscious mind will be altered to make your body language and the way you speak super feminine. You'll act like a stereotypical girl and you will also start to like girly things, like makeup and pretty dresses."
      ],
      "points": {
        "power": 8
      },
      "connectedChoices": "Female",
      "connectedChoiceIDs": [1]
    },
    {
      "title": "Chivalrous",
      "description": [
        "Your subconscious mind will be altered to make you act like a perfect gentleman. You will be gallant, courteous and polite. Acting dishonorably, especially towards women becomes unthinkable to you."
      ],
      "points": {
        "power": 10
      },
      "connectedChoices": "Male",
      "connectedChoiceIDs": [2]
    },
    {
      "title": "Unnatural Skin Color",
      "description": [
        "How about we just change your skin color? That would be totally aaaawseome!- Just pick any unnatural skin color you want and l'll work my magic on you."
      ],
      "points": {
        "power": 8
      },
      "connectedChoices": "Human",
      "connectedChoiceIDs": [3]
    },
    {
      "title": "Otherworldly",
      "description": [
        "You must choose to gain at least 1 major biologically impossible body feature which will affect most of your body. It can be the same as the minor feature you choose from Metahuman, but on a larger scale."
      ],
      "points": {
        "power": 15
      },
      "connectedChoices": "Metahuman",
      "connectedChoiceIDs": [4]
    },
    {
      "title": "Animal Genitals",
      "description": [
        "Instead of having a human cock, you will have the penis of an animal. You may choose the animal, but I highly recommend that you go with a horse cock or a horse pussy!"
      ],
      "points": {
        "power": 10
      },
      "connectedChoices": "Humanoid",
      "connectedChoiceIDs": [5]
    },
    {
      "title": "Airhead",
      "description": [
        "You're going to be a bit dumber. You'll often find yourself lose your train of thought and forget things a lot, but that's totally fine, being a bit ditzy is totally adorbs! Being smart is so overrated."
      ],
      "points": {
        "power": 12
      },
      "connectedChoices": "Blonde",
      "connectedChoiceIDs": [6]
    },
    {
      "title": "Four Eyes",
      "description": [
        "You will get really bad eyesight. Like you will need to wear glasses to see anything. Your eyesight can never get better by magic, technology, etc. While wearing your superhero uniform you can uses lenses, but otherwise, lenses won't work."
      ],
      "points": {
        "power": 7
      },
      "connectedChoices": "Brown",
      "connectedChoiceIDs": [7]
    },
    {
      "title": "Sadist",
      "description": [
        "You will become a huge sadist, nothing will turn you on more than seeing others suffer, especially supervillains and their goons. Making them scream and beg for mercy will feel like the best thing ever."
      ],
      "points": {
        "power": 10
      },
      "connectedChoices": "Black",
      "connectedChoiceIDs": [8]
    },
    {
      "title": "Slut",
      "description": [
        "Your libido will be boosted to slut levels. You'll crave sex on a daily basis and sex it will never be far from your thoughts. If you go to0 long without sex you'll start to act like a bitch in heat."
      ],
      "points": {
        "power": 10
      },
      "connectedChoices": "Red",
      "connectedChoiceIDs": [9]
    },
    {
      "title": "Emotionless",
      "description": [
        "You will become unable to express emotions with your face and your voice. You'll have the best poker face in the world and you will always speak in a flat monotone voice."
      ],
      "points": {
        "power": 10
      },
      "connectedChoices": "White",
      "connectedChoiceIDs": [10]
    },
    {
      "title": "Daddy Issues",
      "description": [
        "You absolutely hate and despise men, yes all men. You will instinctively act like a passive-aggressive little bitch whenever you interact with a man, be it the president or a starving homeless man."
      ],
      "points": {
        "power": 10
      },
      "connectedChoices": "Unnatural",
      "connectedChoiceIDs": [11]
    },
    {
      "title": "Hairless",
      "description": [
        "A delicate body shouldn't be covered in disgusting body hair, don't you agree? No body hair will grow on your body."
      ],
      "points": {
        "power": 3
      },
      "exclude": ["Hairy"],
      "connectedChoices": "Youthful",
      "connectedChoiceIDs": [12]
    },
    {
      "title": "Freckles",
      "description": [
        "You have cute little freckles decorating your face and body! With all those spots you're almost like a human jaguar, rawr!"
      ],
      "points": {
        "power": 3
      },
      "exclude": [],
      "connectedChoices": "Petite",
      "connectedChoiceIDs": [13]
    },
    {
      "title": "Plump Lips",
      "description": [
        "How about some big plump pillowy kissable lips? They will wrap around a cock nicely, perfect for cock sucking!"
      ],
      "points": {
        "power": 7
      },
      "exclude": [],
      "connectedChoices": "Curvacious",
      "connectedChoiceIDs": [14]
    },
    {
      "title": "Basic Bitch",
      "description": [
        "You gain the taste of a basic bitch. For example, you will only enjoy mainstream movies and missionary is now your favorite sex position, anything beyond missionary is disgusting to you, especially anal."
      ],
      "points": {
        "power": 10
      },
      "exclude": [],
      "connectedChoices": "Average",
      "connectedChoiceIDs": [15]
    },
    {
      "title": "Workout Whore",
      "description": [
        "Now you will need to exercise at least 5 hours per week to maintain your body figure. Working out will always make you really horny."
      ],
      "points": {
        "power": 8
      },
      "exclude": ["Chubby", "Fat", "Fat Distribution"],
      "connectedChoices": "Fit",
      "connectedChoiceIDs": [16]
    },
    {
      "title": "Hairy",
      "description": [
        "Your crotch and armpits are hairy. If you cut or remove any hair from these regions it will instantly grow back."
      ],
      "points": {
        "power": 5
      },
      "exclude": ["Hairless"],
      "connectedChoices": "Muscular",
      "connectedChoiceIDs": [17]
    },
    {
      "title": "Crossdresser",
      "description": [
        "Whenever you wear clothes designed for your gender you will feel super uncomfortable. You will only want to wear the opposite gender's clothes."
      ],
      "points": {
        "power": 10
      },
      "exclude": [],
      "connectedChoices": "Androgenous",
      "connectedChoiceIDs": [18]
    },
    {
      "title": "Fat Distribution",
      "description": [
        "You can gain and lose excess fat, all the extra fat you gain will go straight into your tits, ass or thighs, your choice."
      ],
      "points": {
        "power": 5
      },
      "exclude": ["Workout Whore"],
      "connectedChoices": "Chubby",
      "connectedChoiceIDs": [19]
    },
    {
      "title": "Hungry Hippo",
      "description": [
        "You will need to eat 5 times as much as a regular human of your size and you also eat like a total slob. You'll spill food and drink everywhere."
      ],
      "points": {
        "power": 10
      },
      "exclude": [],
      "connectedChoices": "Fat",
      "connectedChoiceIDs": [20]
    },
    {
      "title": "Submissive",
      "description": [
        "You will become more compliant, obedient, passive and less independent. It will feel good to follow orders, serve and please others, not just as a hero but in the bedroom too, especially in the bedroom. In a team of superheroes and superheroines or in a joint effort you will naturally look for guidance and a strong leader to follow. You'll also prefer to take on a supporting role rather than a leading role. While you could strike out as a solo hero, you would be much more confident being a member of a hero team or taking the role of a sidekick."
      ],
      "points": {
        "power": 10
      },
      "exclude": ["Dominant", "Switch"],
      "connectedChoices": ["Tiny", "Small", "Short"],
      "connectedChoiceIDs": [21, 22, 23]
    },
    {
      "title": "Switch",
      "description": [
        "You will randomly switch between being super dominant and confident to being super submissive and meek. The change can happen at any time but it will have a tendency to happen when there is a comedic effect to it."
      ],
      "points": {
        "power": 10
      },
      "exclude": ["Submissive", "Dominant"],
      "connectedChoices": ["Average"],
      "connectedChoiceIDs": [24]
    },
    {
      "title": "Dominant",
      "description": [
        "You will become more confident, bold, strong-willed, decisive and dominant. You'll be a natural leader, but sometimes you might come across as bullish, domineering and bossy. Taking on a supportive role in a hero team or a joint effort will leave you feeling frustrated, to say the least. Becoming someone's sidekick would be almost unthinkable to you, you would second guess all of their decisions and would constantly try to convince them to do things your way. When it comes to sex you'll be just as dominant, if not more."
      ],
      "points": {
        "power": 10
      },
      "exclude": ["Submissive", "Switch"],
      "connectedChoices": ["Tall", "Colossal"],
      "connectedChoiceIDs": [25,26]
    },
    {
      "title": "Breast Envy",
      "description": [
        "You're going to be super jealous of girls with bigger boobs than you. Watching their bigger bouncier tits jiggle in front of you will make you angry, envious and extremely insecure about your own tits. The bigger the tits are the bigger your reaction will be."
      ],
      "points": {
        "power": 10
      },
      "required": ["Flat", "Small Tits", "Medium Tits"],
      "exclude": [],
      "connectedChoices": ["Flat", "Small Tits"],
      "connectedChoiceIDs": [27, 28]
    },
    {
      "title": "Erogenous Nipples",
      "description": [
        "Your nipples are now really sensitive and an erogenous zone. Continuous stimulation will make you climax. I recommend wearing pasties over your nipples to keep your nipples from rubbing against your bra."
      ],
      "points": {
        "power": 10
      },
      "required": [],
      "exclude": [],
      "connectedChoices": ["Medium Tits"],
      "connectedChoiceIDs": [29]
    },
    {
      "title": "Fuckable Nipples",
      "description": [
        "Your nipples are stretchy enough to be fuckable and oh boy it will feel good to fuck them!"
      ],
      "points": {
        "power": 7
      },
      "required": [],
      "exclude": ["Flat"],
      "connectedChoices": ["Large Tits"],
      "connectedChoiceIDs": [30]
    },
    {
      "title": "Lactation",
      "description": [
        "You'll need to milk your breasts on a daily basis or your tits are going to swell and feel sore."
      ],
      "points": {
        "power": 10
      },
      "required": [],
      "exclude": ["Flat"],
      "connectedChoices": ["Big Tits"],
      "connectedChoiceIDs": [31]
    },
    {
      "title": "Inverted Nipples",
      "description": [
        "Whenever your nipples are not erect their inverted, hidden inside your big fat tiddies!"
      ],
      "points": {
        "power": 7
      },
      "required": [],
      "exclude": ["Flat"],
      "connectedChoices": ["Super Tits"],
      "connectedChoiceIDs": [32]
    },
    {
      "title": "Anal Hater",
      "description": [
        "Your anus feels absolutely amazing to fuck. However, anal stimulation is outright painful for you. You won't be able to enjoy anal sex unless you're a huge masochist. Not only is the penetration painful, but the pain will linger, it will make you walk funny for a couple of days afterward."
      ],
      "points": {
        "power": 10
      },
      "required": [],
      "exclude": ["Buttslut"],
      "connectedChoices": ["Tiny Ass", "Small Ass"],
      "connectedChoiceIDs": [33, 34]
    },
    {
      "title": "Sensitive Butt",
      "description": [
        "Your butt is very sensitive, spanking will feel much more intense. When spanked, your bodily orifices will temporarily become tighter and spanking marks will also last much much longer."
      ],
      "points": {
        "power": 7
      },
      "required": [],
      "exclude": [],
      "connectedChoices": ["Medium Ass"],
      "connectedChoiceIDs": [35]
    },
    {
      "title": "Puffy Anus",
      "description": [
        "Your anus is big and puffy. Your ring muscle will naturally squeeze anything that enters it. I hope you weren't planning on wearing anything skintight, cause such apparel wouldn't be able to hide your protruding donut anus."
      ],
      "points": {
        "power": 8
      },
      "required": [],
      "exclude": [],
      "connectedChoices": ["Large Ass"],
      "connectedChoiceIDs": [36]
    },
    {
      "title": "Buttslut",
      "description": [
        "Getting penetrated in the ass will make you cum like crazy, once you have tried it you will become addicted to it. Abstaining from anal stimulation will decrease your thirst for butt sex."
      ],
      "points": {
        "power": 10
      },
      "required": [],
      "exclude": ["Anal Hater"],
      "connectedChoices": ["Big Ass"],
      "connectedChoiceIDs": [37]
    },
    {
      "title": "Puffy Pussy",
      "description": [
        "You will have a huge puffy pussy. Your cunt cushion will tightly wrap around any cock and make vaginal penetration more pleasurable. However, wearing yoga pants or anything remotely tight will always give you a huge camel toe."
      ],
      "points": {
        "power": 8
      },
      "required": ["Vagina"],
      "exclude": [],
      "connectedChoices": ["Super Ass"],
      "connectedChoiceIDs": [38]
    },
    {
      "title": "Penis Vagina",
      "description": [
        "Why choose between having a vagina or a penis when you can have both? Choose another option in this section, yes you will gain Power Points from the penis option you choose."
      ],
      "points": {
        "power": -3
      },
      "required": ["Vagina"],
      "exclude": [],
      "connectedChoices": ["Vagina"],
      "connectedChoiceIDs": [39]
    },
    {
      "title": "Premature Ejaculation",
      "description": [
        "When you get sexually excited you have a tendency to blow your load, so to speak. Often before you even put it in, talk about embarrassing!"
      ],
      "points": {
        "power": 20
      },
      "required": [],
      "exclude": ["Vagina"],
      "exception": { "title": "Penis Vagina", "excludes": "Vagina" },
      "customRequirementText": ["Requirement: Not Vagina or Penis Vagina"],
      "connectedChoices": ["Small Penis"],
      "connectedChoiceIDs": [40]
    },
    {
      "title": "Limp Dick",
      "description": [
        "Your dick is completely limp, it cannot get erect. Beyond that, your penis works perfectly fine."
      ],
      "points": {
        "power": 20
      },
      "required": [],
      "exclude": ["Vagina", "Always Hard"],
      "exception": { "title": "Penis Vagina", "excludes": "Vagina" },
      "customRequirementText": ["Requirement: Not Vagina (or Penis Vagina) and Not Always Hard"],
      "connectedChoices": ["Medium Penis"],
      "connectedChoiceIDs": [41]
    },
    {
      "title": "Always Hard",
      "description": [
        "Your cock (and/or clitoris) is perpetually erect. Whenever you get horny your erection will turn into a throbbing erection."
      ],
      "points": {
        "power": 9
      },
      "required": [],
      "exclude": ["Limp Dick"],
      "connectedChoices": ["Large Penis"],
      "connectedChoiceIDs": [42]
    },
    {
      "title": "Fuckable Peehole",
      "description": [
        "Your urethra is now elastic and fuckable. It's quite a tight fit and will feel amazing to fuck! Are you ready to get your peehole violated?"
      ],
      "points": {
        "power": 7
      },
      "required": [],
      "exclude": [],
      "connectedChoices": ["Big Penis"],
      "connectedChoiceIDs": [43]
    },
    {
      "title": "Liquid Fountain",
      "description": [
        "Whenever you cum you will ejaculate huge amounts of sexual fluid! Like a penis would become a cum hose during climax with this drawback."
      ],
      "points": {
        "power": 10
      },
      "required": [],
      "exclude": [],
      "connectedChoices": ["Super Penis"],
      "connectedChoiceIDs": [44]
    }
  ],
  "skeletons": {
    "basic": {
      "title": "",
      "description": [
        ""
      ],
      "points": {
        "power": 0
      },
      "connectedDrawback": ""
    },
    "drawback": {
      "title": "",
      "description": [
        ""
      ],
      "points": {
        "power": 0
      },
      "connectedChoices": ""
    },
    "drawback_with_exclusions": {
      "title": "",
      "description": [
        ""
      ],
      "points": {
        "power": 0
      },
      "exclude": [""],
      "connectedChoices": ""
    }
  }
}
